/*//测试位运算符的使用
// 
//  <<  >>  &  |  ^  ~
//
//1.位运算符针对的是整数数值做的运算
//2.运算规则：在一定范围内，数据每向左移动一位，相当于原数据 * 2。（正数、负数都适用）
//	运算规则：在一定范围内，数据每向右移动一位，相当于原数据 / 2。（正数、负数都适用）

//练习：高效的方式计算2 * 8的值（经典面试题）
//		2 << 3  ,  8 << 1

#include <stdio.h>



int main()
{
	int a = 3;
	printf("%d\n", a << 1);
	printf("%d\n", a << 2);
	printf("%d\n", a << 3);
	printf("%d\n", a << 4);

	int a1 = -3;
	printf("%d\n", a1 << 1);
	printf("%d\n", a1 << 2);

	int a3 = 12;
	printf("%d\n", a3 >> 1);
	printf("%d\n", a3 >> 2);

	printf("%d\n", 9 & 7);
	printf("%d\n", 9 | 7);
	printf("%d\n", ~9);
	printf("%d\n", ~-10);

	return 0;
}*/